TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_flashctl.h
/* FLASHCTL_CMDDATAECC4 Bits */
/* FLASHCTL_CMDDATAECC4[VAL0] Bits */
#define FLASHCTL_CMDDATAECC4_VAL0_OFS            (0)                             /* !< VAL0 Offset */
#define FLASHCTL_CMDDATAECC4_VAL0_MASK           ((uint32_t)0x000000FFU)         /* !< ECC data for bits 63:0 of the data
                                                                                    is placed here. */
#define FLASHCTL_CMDDATAECC4_VAL0_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum value */
#define FLASHCTL_CMDDATAECC4_VAL0_MAXIMUM        ((uint32_t)0x000000FFU)         /* !< Maximum value */
/* FLASHCTL_CMDDATAECC4[VAL1] Bits */
#define FLASHCTL_CMDDATAECC4_VAL1_OFS            (8)                             /* !< VAL1 Offset */
#define FLASHCTL_CMDDATAECC4_VAL1_MASK           ((uint32_t)0x0000FF00U)         /* !< ECC data for bits 127:64 of the
                                                                                    data is placed here. */
#define FLASHCTL_CMDDATAECC4_VAL1_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum value */
#define FLASHCTL_CMDDATAECC4_VAL1_MAXIMUM        ((uint32_t)0x0000FF00U)         /* !< Maximum value */

/* FLASHCTL_CMDDATAECC5 Bits */
/* FLASHCTL_CMDDATAECC5[VAL0] Bits */
#define FLASHCTL_CMDDATAECC5_VAL0_OFS            (0)                             /* !< VAL0 Offset */
#define FLASHCTL_CMDDATAECC5_VAL0_MASK           ((uint32_t)0x000000FFU)         /* !< ECC data for bits 63:0 of the data
                                                                                    is placed here. */
#define FLASHCTL_CMDDATAECC5_VAL0_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum value */
#define FLASHCTL_CMDDATAECC5_VAL0_MAXIMUM        ((uint32_t)0x000000FFU)         /* !< Maximum value */
/* FLASHCTL_CMDDATAECC5[VAL1] Bits */
#define FLASHCTL_CMDDATAECC5_VAL1_OFS            (8)                             /* !< VAL1 Offset */
#define FLASHCTL_CMDDATAECC5_VAL1_MASK           ((uint32_t)0x0000FF00U)         /* !< ECC data for bits 127:64 of the
                                                                                    data is placed here. */
#define FLASHCTL_CMDDATAECC5_VAL1_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum value */
#define FLASHCTL_CMDDATAECC5_VAL1_MAXIMUM        ((uint32_t)0x0000FF00U)         /* !< Maximum value */

/* FLASHCTL_CMDDATAECC6 Bits */
/* FLASHCTL_CMDDATAECC6[VAL0] Bits */
#define FLASHCTL_CMDDATAECC6_VAL0_OFS            (0)                             /* !< VAL0 Offset */
#define FLASHCTL_CMDDATAECC6_VAL0_MASK           ((uint32_t)0x000000FFU)         /* !< ECC data for bits 63:0 of the data
                                                                                    is placed here. */
#define FLASHCTL_CMDDATAECC6_VAL0_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum value */
#define FLASHCTL_CMDDATAECC6_VAL0_MAXIMUM        ((uint32_t)0x000000FFU)         /* !< Maximum value */
/* FLASHCTL_CMDDATAECC6[VAL1] Bits */
#define FLASHCTL_CMDDATAECC6_VAL1_OFS            (8)                             /* !< VAL1 Offset */
#define FLASHCTL_CMDDATAECC6_VAL1_MASK           ((uint32_t)0x0000FF00U)         /* !< ECC data for bits 127:64 of the
                                                                                    data is placed here. */
#define FLASHCTL_CMDDATAECC6_VAL1_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum value */
#define FLASHCTL_CMDDATAECC6_VAL1_MAXIMUM        ((uint32_t)0x0000FF00U)         /* !< Maximum value */

/* FLASHCTL_CMDDATAECC7 Bits */
/* FLASHCTL_CMDDATAECC7[VAL0] Bits */
#define FLASHCTL_CMDDATAECC7_VAL0_OFS            (0)                             /* !< VAL0 Offset */
#define FLASHCTL_CMDDATAECC7_VAL0_MASK           ((uint32_t)0x000000FFU)         /* !< ECC data for bits 63:0 of the data
                                                                                    is placed here. */
#define FLASHCTL_CMDDATAECC7_VAL0_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum value */
#define FLASHCTL_CMDDATAECC7_VAL0_MAXIMUM        ((uint32_t)0x000000FFU)         /* !< Maximum value */
/* FLASHCTL_CMDDATAECC7[VAL1] Bits */
#define FLASHCTL_CMDDATAECC7_VAL1_OFS            (8)                             /* !< VAL1 Offset */
#define FLASHCTL_CMDDATAECC7_VAL1_MASK           ((uint32_t)0x0000FF00U)         /* !< ECC data for bits 127:64 of the
                                                                                    data is placed here. */
#define FLASHCTL_CMDDATAECC7_VAL1_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum value */
#define FLASHCTL_CMDDATAECC7_VAL1_MAXIMUM        ((uint32_t)0x0000FF00U)         /* !< Maximum value */

/* FLASHCTL_CMDWEPROTA Bits */
/* FLASHCTL_CMDWEPROTA[VAL] Bits */
#define FLASHCTL_CMDWEPROTA_VAL_OFS              (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDWEPROTA_VAL_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Each bit protects 1 sector.  bit
                                                                                    [0]:	When 1, sector 0 of the flash
                                                                                    memory will be protected from program
                                                                                    and erase. bit [1]:	When 1, sector
                                                                                    1 of the flash memory will be
                                                                                    protected from program 		and erase.
                                                                                    : 	: bit [31]:	When 1, sector 31 of
                                                                                    the flash memory will be protected
                                                                                    from program 		and erase. */
#define FLASHCTL_CMDWEPROTA_VAL_MINIMUM          ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDWEPROTA_VAL_MAXIMUM          ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDWEPROTB Bits */
/* FLASHCTL_CMDWEPROTB[VAL] Bits */
#define FLASHCTL_CMDWEPROTB_VAL_OFS              (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDWEPROTB_VAL_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Each bit protects a group of 8
                                                                                    sectors.  When a bit is 1, the
                                                                                    associated 8 sectors in the flash
                                                                                    will be protected from program and
                                                                                    erase.  A maximum of 256 sectors can
                                                                                    be protected with this register. */
#define FLASHCTL_CMDWEPROTB_VAL_MINIMUM          ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDWEPROTB_VAL_MAXIMUM          ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDWEPROTC Bits */
/* FLASHCTL_CMDWEPROTC[VAL] Bits */
#define FLASHCTL_CMDWEPROTC_VAL_OFS              (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDWEPROTC_VAL_MASK             ((uint32_t)0xFFFFFFFFU)         /* !< Each bit protects a group of 8
                                                                                    sectors.  When a bit is 1, the
                                                                                    associated 8 sectors in the flash
                                                                                    will be protected from program and
                                                                                    erase.  Note that the sectors
                                                                                    protected with this register start at
                                                                                    sector 256 in the flash, where the
                                                                                    sectors protected by the CMDWEPROTB
                                                                                    register end. */
#define FLASHCTL_CMDWEPROTC_VAL_MINIMUM          ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDWEPROTC_VAL_MAXIMUM          ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDWEPROTNM Bits */
/* FLASHCTL_CMDWEPROTNM[VAL] Bits */
#define FLASHCTL_CMDWEPROTNM_VAL_OFS             (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDWEPROTNM_VAL_MASK            ((uint32_t)0xFFFFFFFFU)         /* !< Each bit protects 1 sector.  bit
                                                                                    [0]:	When 1, sector 0 of the non-main
                                                                                    region will be protected from program
                                                                                    and erase. bit [1]:	When 1, sector
                                                                                    1 of the non-main region will be
                                                                                    protected from program 		and erase.
                                                                                    : 	: bit [31]:	When 1, sector 31 of
                                                                                    the non-main will be protected from
                                                                                    program 		and erase. */
#define FLASHCTL_CMDWEPROTNM_VAL_MINIMUM         ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDWEPROTNM_VAL_MAXIMUM         ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDWEPROTTR Bits */
/* FLASHCTL_CMDWEPROTTR[VAL] Bits */
#define FLASHCTL_CMDWEPROTTR_VAL_OFS             (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDWEPROTTR_VAL_MASK            ((uint32_t)0xFFFFFFFFU)         /* !< Each bit protects 1 sector.  bit
                                                                                    [0]:	When 1, sector 0 of the engr
                                                                                    region will be protected from program
                                                                                    and erase. bit [1]:	When 1, sector
                                                                                    1 of the engr region will be
                                                                                    protected from program 		and erase.
                                                                                    : 	: bit [31]:	When 1, sector 31 of
                                                                                    the engr region will be protected
                                                                                    from program 		and erase. */
#define FLASHCTL_CMDWEPROTTR_VAL_MINIMUM         ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDWEPROTTR_VAL_MAXIMUM         ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

/* FLASHCTL_CMDWEPROTEN Bits */
/* FLASHCTL_CMDWEPROTEN[VAL] Bits */
#define FLASHCTL_CMDWEPROTEN_VAL_OFS             (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDWEPROTEN_VAL_MASK            ((uint32_t)0xFFFFFFFFU)         /* !< Each bit protects 1 sector.  bit
                                                                                    [0]:	When 1, sector 0 of the engr
                                                                                    region will be protected from program
                                                                                    and erase. bit [1]:	When 1, sector
                                                                                    1 of the engr region will be
                                                                                    protected from program 		and erase.
                                                                                    : 	: bit [31]:	When 1, sector 31 of
                                                                                    the engr region will be protected
                                                                                    from program 		and erase. */
#define FLASHCTL_CMDWEPROTEN_VAL_MINIMUM         ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDWEPROTEN_VAL_MAXIMUM         ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

